#+TITLE: List of learning activities
#+FILETAGS: :Learning:
#+STARTUP: overview, hideallblocks

* Manager Tools: You do not stop learning when you grow old, you grow old when you stop learning. :quotes:

* Periodic tasks                                                   :Periodic:

** TODO Complete [[elisp:(org-agenda t "lt")][learning tasks]]
SCHEDULED: <2026-05-04 Mon 20:00 +7d>
   :PROPERTIES:
   :EFFORT: 01:30
   :BENEFIT: 200
   :RATIO: 2.00
   :LAST_REPEAT: [2026-04-27 Mon 20:35]
   :PRIORITY_NUM: 3
   :VALUE:    50.00
   :END:
   - State "DONE"       from "TODO"       [2026-04-27 Mon 20:35]
   - State "DONE"       from "TODO"       [2026-04-21 Tue 05:42]
   - State "DONE"       from "TODO"       [2026-04-12 Sun 20:47]
   - State "DONE"       from "TODO"       [2026-04-11 Sat 20:23]
   - State "DONE"       from "TODO"       [2026-04-11 Sat 09:32]
   - State "DONE"       from "TODO"       [2026-04-10 Fri 05:49]
   - State "DONE"       from "TODO"       [2026-02-20 Fri 07:07]
   - State "DONE"       from "TODO"       [2026-02-07 Sat 15:43]
   - State "DONE"       from "TODO"       [2026-01-29 Thu 20:50]
   - State "DONE"       from "TODO"       [2026-01-28 Wed 11:25]
   - State "DONE"       from "TODO"       [2026-01-27 Tue 12:36]
   - State "DONE"       from "TODO"       [2026-01-26 Mon 10:34]
   - State "DONE"       from "TODO"       [2026-01-25 Sun 20:18]
   - State "DONE"       from "TODO"       [2026-01-24 Sat 20:56]
   - State "DONE"       from "TODO"       [2026-01-23 Fri 20:31]
   - State "DONE"       from "TODO"       [2026-01-22 Thu 21:14]
   - State "DONE"       from "TODO"       [2026-01-20 Tue 10:34]
   - State "DONE"       from "TODO"       [2026-01-18 Sun 11:12]
   - State "DONE"       from "TODO"       [2026-01-16 Fri 20:50]
   - State "DONE"       from "TODO"       [2026-01-16 Fri 05:54]
   - State "DONE"       from "TODO"       [2026-01-11 Sun 10:35]
   - State "DONE"       from "TODO"       [2026-01-09 Fri 10:21]
   - State "DONE"       from "TODO"       [2026-01-08 Thu 19:39]
   - State "DONE"       from "TODO"       [2026-01-08 Thu 17:02]
   - State "DONE"       from "TODO"       [2026-01-06 Tue 09:33]
   - State "DONE"       from "TODO"       [2026-01-05 Mon 09:35]
   - State "DONE"       from "TODO"       [2026-01-04 Sun 20:51]
   - State "DONE"       from "TODO"       [2026-01-03 Sat 11:26]
   - State "DONE"       from "TODO"       [2026-01-03 Sat 08:58]
   - State "DONE"       from "TODO"       [2026-01-01 Thu 10:21]
   - State "DONE"       from "TODO"       [2025-12-24 Wed 08:43]
   - State "DONE"       from "TODO"       [2025-12-23 Tue 16:17]
   - State "DONE"       from "TODO"       [2025-12-22 Mon 15:05]
   - State "DONE"       from "TODO"       [2025-12-21 Sun 20:49]
   - State "DONE"       from "TODO"       [2025-12-20 Sat 17:01]
   - State "DONE"       from "TODO"       [2025-12-19 Fri 09:41]
   - State "DONE"       from "TODO"       [2025-12-18 Thu 15:24]
   - State "DONE"       from "TODO"       [2025-12-17 Wed 10:02]
   - State "DONE"       from "TODO"       [2025-12-16 Tue 10:28]
   - State "DONE"       from "TODO"       [2025-12-15 Mon 19:39]
   - State "DONE"       from "TODO"       [2025-12-14 Sun 14:55]
   - State "DONE"       from "TODO"       [2025-12-13 Sat 21:36]
   - State "DONE"       from "TODO"       [2025-12-12 Fri 10:32]
   - State "DONE"       from "TODO"       [2025-12-10 Wed 09:42]
   - State "DONE"       from "TODO"       [2025-12-09 Tue 14:51]
   - State "DONE"       from "TODO"       [2025-12-08 Mon 08:36]
   - State "DONE"       from "TODO"       [2025-12-07 Sun 09:32]
   - State "DONE"       from "TODO"       [2025-12-04 Thu 12:32]
   - State "DONE"       from "TODO"       [2025-12-03 Wed 09:37]
   - State "DONE"       from "TODO"       [2025-12-02 Tue 08:01]
   - State "DONE"       from "TODO"       [2025-12-01 Mon 08:29]
   - State "DONE"       from "TODO"       [2025-11-30 Sun 17:33]
   - State "DONE"       from "TODO"       [2025-11-23 Sun 17:45]
   - State "DONE"       from "TODO"       [2025-11-16 Sun 15:54]
   - State "DONE"       from "TODO"       [2025-11-09 Sun 11:35]
   - State "DONE"       from "TODO"       [2025-11-02 Sun 16:11]
   - State "DONE"       from "TODO"       [2025-10-26 Sun 10:25]
   - State "DONE"       from "TODO"       [2025-10-19 Sun 17:03]
   - State "DONE"       from "TODO"       [2025-10-13 Mon 06:35]
   - State "DONE"       from "TODO"       [2025-10-06 Mon 08:15]
   - State "DONE"       from "TODO"       [2025-09-29 Mon 06:33]
   - State "DONE"       from "TODO"       [2025-09-22 Mon 05:45]
   - State "DONE"       from "TODO"       [2025-09-21 Sun 07:28]
   - State "DONE"       from "TODO"       [2025-09-14 Sun 09:46]
   :LOGBOOK:
   CLOCK: [2025-09-14 Sun 07:28]--[2025-09-14 Sun 08:45] =>  1:17
   CLOCK: [2025-09-14 Sun 07:27]--[2025-09-14 Sun 07:28] =>  0:01
   :END:
   - State "DONE"       from "TODO"       [2025-09-07 Sun 10:52]
   - State "DONE"       from "TODO"       [2025-09-01 Mon 20:57]
   - State "DONE"       from "TODO"       [2025-08-24 Sun 15:03]
   - State "DONE"       from "TODO"       [2025-08-17 Sun 07:32]
   - State "DONE"       from "TODO"       [2025-08-10 Sun 18:16]
   - State "DONE"       from "TODO"       [2025-08-10 Sun 18:16]
   - State "DONE"       from "TODO"       [2025-08-10 Sun 18:16]
   - State "DONE"       from "TODO"       [2025-08-04 Mon 12:10]
   - State "DONE"       from "TODO"       [2025-07-14 Mon 10:50]
   - State "DONE"       from "TODO"       [2025-07-06 Sun 20:44]
   - State "DONE"       from "TODO"       [2025-06-29 Sun 20:31]
   - State "DONE"       from "TODO"       [2025-06-23 Mon 06:56]
   - State "DONE"       from "TODO"       [2025-06-14 Sat 21:01]
   - State "DONE"       from "TODO"       [2025-06-08 Sun 14:58]
   - State "DONE"       from "TODO"       [2025-06-01 Sun 15:57]
   - State "DONE"       from "TODO"       [2025-05-26 Mon 16:31]
   - State "DONE"       from "TODO"       [2025-05-18 Sun 17:01]
   - State "DONE"       from "TODO"       [2025-05-11 Sun 14:23]
   - State "DONE"       from "TODO"       [2025-05-04 Sun 15:59]
   - State "DONE"       from "TODO"       [2025-04-27 Sun 16:47]

** TODO Complete [[elisp:(org-agenda t "lt")][learning tasks]]
SCHEDULED: <2026-04-28 Tue 20:00 +7d>
   :PROPERTIES:
   :EFFORT: 01:30
   :BENEFIT: 200
   :RATIO: 2.00
   :LAST_REPEAT: [2026-04-22 Wed 08:57]
   :PRIORITY_NUM: 3
   :VALUE:    50.00
   :END:

   - State "DONE"       from "TODO"       [2026-04-22 Wed 08:57]
   - State "DONE"       from "TODO"       [2026-04-14 Tue 20:57]

** TODO Complete [[elisp:(org-agenda t "lt")][learning tasks]]
SCHEDULED: <2026-04-29 Wed 20:00 +7d>
   :PROPERTIES:
   :EFFORT: 01:30
   :BENEFIT: 200
   :RATIO: 2.00
   :LAST_REPEAT: [2026-04-22 Wed 21:29]
   :PRIORITY_NUM: 3
   :VALUE:    50.00
   :END:

   - State "DONE"       from "TODO"       [2026-04-22 Wed 21:29]
   - State "DONE"       from "TODO"       [2026-04-16 Thu 14:20]
** TODO Complete [[elisp:(org-agenda t "lt")][learning tasks]]
SCHEDULED: <2026-04-30 Thu 20:00 +7d>
   :PROPERTIES:
   :EFFORT: 01:30
   :BENEFIT: 200
   :RATIO: 2.00
   :LAST_REPEAT: [2026-04-24 Fri 06:40]
   :PRIORITY_NUM: 3
   :VALUE:    50.00
   :END:

   - State "DONE"       from "TODO"       [2026-04-24 Fri 06:40]
   - State "DONE"       from "TODO"       [2026-04-16 Thu 20:31]
** TODO Complete [[elisp:(org-agenda t "lt")][learning tasks]]
SCHEDULED: <2026-05-01 Fri 20:00 +7d>
   :PROPERTIES:
   :EFFORT: 01:30
   :BENEFIT: 200
   :RATIO: 2.00
   :LAST_REPEAT: [2026-04-24 Fri 21:01]
   :PRIORITY_NUM: 3
   :VALUE:    50.00
   :END:

   - State "DONE"       from "TODO"       [2026-04-24 Fri 21:01]
   - State "DONE"       from "TODO"       [2026-04-18 Sat 10:23]
** TODO Review [[elisp:(org-agenda t "lb")][learning backlog]]
   :PROPERTIES:
   :EFFORT: 01:00
   :BENEFIT: 200
   :RATIO: 2.00
   :LAST_REPEAT: [2026-02-01 Sun 10:09]
   :PRIORITY_NUM: 3
   :VALUE:    100.00
   :END:



   - State "DONE"       from "TODO"       [2026-02-01 Sun 10:09]
   - State "DONE"       from "TODO"       [2026-01-04 Sun 11:10]
   - State "DONE"       from "TODO"       [2025-12-07 Sun 21:22]
   - State "DONE"       from "TODO"       [2025-11-09 Sun 11:35]
   - State "DONE"       from "TODO"       [2025-10-13 Mon 06:35]
   - State "DONE"       from "TODO"       [2025-09-14 Sun 11:49]
   - State "DONE"       from "TODO"       [2025-08-17 Sun 07:32]
   - State "DONE"       from "TODO"       [2025-07-14 Mon 10:50]
   - State "DONE"       from "TODO"       [2025-06-15 Sun 07:12]
   - State "DONE"       from "TODO"       [2025-05-18 Sun 17:01]

* Tasks

** Archive                                                          :ARCHIVE:
*** DONE Read "Pragmatic Thinking and Learning" and [[id:1b62c6dd-c98f-45c4-b85d-d4162a880e2b][update notes]]
SCHEDULED: <2025-08-24 Sun>
:PROPERTIES:
:EFFORT:  10:00
:BENEFIT: 1000
:RATIO: 1.00
:ARCHIVE_TIME: 2025-09-14 Sun 21:06
:END:
:LOGBOOK:
CLOCK: [2025-06-29 Sun 07:21]--[2025-06-29 Sun 08:16] =>  0:51
CLOCK: [2025-05-11 Sun 06:40]--[2025-05-11 Sun 07:40] =>  1:00
CLOCK: [2025-02-23 Sun 06:50]--[2025-02-23 Sun 08:02] =>  1:12
CLOCK: [2025-02-09 Sun 06:37]--[2025-02-09 Sun 07:33] =>  0:56
CLOCK: [2025-04-27 Sun 06:45]--[2025-04-27 Sun 08:15] =>  1:30
:END:

*** DONE Read AWS DynamoDB incident https://www.linkedin.com/posts/adriancockcroft_summary-of-the-amazon-dynamodb-service-disruption-activity-7387117492135133184-WG9Y?utm_source=share&utm_medium=member_android&rcm=ACoAAAAZ0isBP1gxnt30MfLp_T0BAPWL4JS56Us :Learning:
:PROPERTIES:
:EFFORT: 00:15
:BENEFIT: 10
:RATIO: 0.40
:ARCHIVE_TIME: 2025-10-26 Sun 21:36
:END:
- State "DONE"       from "TODO"       [2025-10-26 Sun 10:44]
:LOGBOOK:
CLOCK: [2025-10-26 Sun 10:30]--[2025-10-26 Sun 10:44] =>  0:14
:END:
*** DONE Read [[https://drive.google.com/file/d/1alFqtRykdJUF-J7Ty0NBnoTK5kQCE8qE/view?usp=sharing][Inconvenient truth about AI in healthcare]] :Career:
   SCHEDULED: <2025-10-20 Mon>
   :PROPERTIES:
   :EFFORT: 00:15
   :BENEFIT: 25
   :RATIO: 1.00
   :ARCHIVE_TIME: 2025-11-02 Sun 16:27
   :END:

*** DONE Take notes on Thinking fast and slow
   SCHEDULED: <2025-12-10 Wed>
   :PROPERTIES:
   :EFFORT: 02:00
   :BENEFIT: 250
   :ARCHIVE_TIME: 2025-12-14 Sun 10:49
   :END:
   - State "DONE"       from "TODO"       [2025-12-10 Wed 09:42]
   :LOGBOOK:
   CLOCK: [2025-12-10 Wed 06:01]--[2025-12-10 Wed 08:31] =>  2:30
   :END:


*** DONE Read about [[https://github.com/emacs-slack/emacs-slack/blob/master/README.md][Emacs Slack integration]]
  :PROPERTIES:
  :EFFORT: 00:15
  :BENEFIT: 10
  :RATIO: 0.40
  :PRIORITY_NUM: 1
  :VALUE:    -15.00
  :ARCHIVE_TIME: 2026-01-11 Sun 10:46
  :END:

  - State "DONE"       from "TODO"       [2026-01-03 Sat 09:50]

*** DONE Read Apache Spark book with Pandas (248/500) (~500 pages at 10 pages/hour)
:PROPERTIES:
:EFFORT:  50:00
:BENEFIT: 2000
:RATIO: 0.40
:LAST_REPEAT: [2025-12-12 Fri 10:32]
:VALUE:    -3000.00
:PRIORITY_NUM: 1
:ARCHIVE_TIME: 2026-03-23 Mon 20:50
:END:
- State "DONE"       from "TODO"       [2026-03-19 Thu 05:48]
- State "DONE"       from "TODO"       [2025-12-12 Fri 10:32]
- State "DONE"       from "TODO"       [2025-12-04 Thu 12:31]
- State "DONE"       from "TODO"       [2025-12-03 Wed 09:37]
- State "DONE"       from "TODO"       [2025-12-02 Tue 08:01]
- State "DONE"       from "TODO"       [2025-12-01 Mon 08:27]
- State "DONE"       from "TODO"       [2025-11-17 Mon 08:23]
- State "DONE"       from "TODO"       [2025-11-12 Wed 07:53]
- State "DONE"       from "TODO"       [2025-11-11 Tue 07:59]
- State "DONE"       from "TODO"       [2025-11-07 Fri 16:33]
- State "DONE"       from "TODO"       [2025-11-07 Fri 16:33]
- State "DONE"       from "TODO"       [2025-11-07 Fri 16:32]
- State "DONE"       from "TODO"       [2025-11-07 Fri 09:01]
- State "DONE"       from "TODO"       [2025-11-06 Thu 08:26]
- State "DONE"       from "TODO"       [2025-11-06 Thu 08:26]
- State "DONE"       from "TODO"       [2025-11-05 Wed 08:01]
- State "DONE"       from "TODO"       [2025-11-03 Mon 08:26]
- State "DONE"       from "TODO"       [2025-10-29 Wed 09:02]
- State "DONE"       from "TODO"       [2025-10-28 Tue 08:19]
:LOGBOOK:
CLOCK: [2025-12-12 Fri 06:21]--[2025-12-12 Fri 10:21] =>  4:00
CLOCK: [2025-12-11 Thu 06:33]--[2025-12-11 Thu 08:09] =>  1:36
CLOCK: [2025-12-04 Thu 11:11]--[2025-12-04 Thu 12:31] =>  1:20
CLOCK: [2025-12-03 Wed 07:06]--[2025-12-03 Wed 09:36] =>  2:30
CLOCK: [2025-12-02 Tue 07:02]--[2025-12-02 Tue 08:01] =>  0:59
CLOCK: [2025-12-01 Mon 06:27]--[2025-12-01 Mon 08:27] =>  2:00
CLOCK: [2025-11-17 Mon 06:33]--[2025-11-17 Mon 08:23] =>  1:50
CLOCK: [2025-11-12 Wed 06:24]--[2025-11-12 Wed 07:48] =>  1:24
CLOCK: [2025-11-11 Tue 06:29]--[2025-11-11 Tue 07:59] =>  1:30
CLOCK: [2025-11-07 Fri 06:36]--[2025-11-07 Fri 09:01] =>  2:25
CLOCK: [2025-11-06 Thu 06:35]--[2025-11-06 Thu 08:25] =>  1:50
CLOCK: [2025-11-05 Wed 06:54]--[2025-11-05 Wed 07:49] =>  0:55
CLOCK: [2025-11-03 Mon 07:55]--[2025-11-03 Mon 08:24] =>  0:29
CLOCK: [2025-10-29 Wed 07:26]--[2025-10-29 Wed 08:26] =>  1:00
CLOCK: [2025-10-28 Tue 07:11]--[2025-10-28 Tue 08:19] =>  1:08
:END:


*** DONE Read [[id:102ddbb5-4948-47e6-9526-8c364ada9fdb][serverless whitepaper]]
:PROPERTIES:
:ARCHIVE_TIME: 2026-04-19 Sun 20:46
:END:

- State "DONE"       from "TODO"       [2026-04-13 Mon 20:50]
*** DONE Write doc on [[https://docs.google.com/document/d/1tN8tc0oYsAO_9QKacvlsWBKoIld-1UzQvW3cyf5VvaI/edit?usp=sharing][AI agent load management]] :Learning:
   :PROPERTIES:
   :EFFORT: 05:00
   :BENEFIT: 2000
   :VALUE:    1500.00
   :PRIORITY_NUM: 2
   :ARCHIVE_TIME: 2026-04-19 Sun 20:46
   :END:
   - State "DONE"       from "TODO"       [2026-04-13 Mon 20:50]
   :LOGBOOK:
   CLOCK: [2026-01-12 Mon 06:21]--[2026-01-12 Mon 07:29] =>  1:08
   :END:

*** DONE Save [[https://seths.blog/2005/03/dont_shave_that/][Don't shave that yak]] article
   :PROPERTIES:
   :EFFORT: 00:15
   :BENEFIT: 25
   :RATIO: 1.00
   :PRIORITY_NUM: 1
   :VALUE:    0.00
   :ARCHIVE_TIME: 2026-04-19 Sun 20:46
   :END:

   - State "DONE"       from "TODO"       [2026-04-13 Mon 20:33]
** TODO Read [[https://www.amazon.com/Fundamentals-Data-Engineering-Joe-Reis-ebook/dp/B0B4VH4T37][Fundamentals of Data Engineering]]
:PROPERTIES:
:PRIORITY_NUM: 1
:VALUE:    N/A
:END:

** TODO Do an [[id:0ed956b1-7a46-41f8-9823-03db651ce312][AWS EC2 learning project]] to run regular Git updates :Cloud:
   :PROPERTIES:
   :EFFORT: 04:00
   :BENEFIT:  500
   :RATIO: 1.25
   :PRIORITY_NUM: 1
   :VALUE:    100.00
   :END:

** TODO Read about Eclipse ThreadX                            :Learning:
:PROPERTIES:
:PRIORITY_NUM: 1
:VALUE:    N/A
:END:

** TODO Read about Rust programming                           :Learning:
:PROPERTIES:
:PRIORITY_NUM: 1
:VALUE:    N/A
:END:

** TODO Read about Docker containers
:PROPERTIES:
:PRIORITY_NUM: 1
:VALUE:    N/A
:END:

** TODO Read about Kubernetes
:PROPERTIES:
:PRIORITY_NUM: 1
:VALUE:    N/A
:END:

** TODO Study Apache Superset as a visualization tool         :Learning:
:PROPERTIES:
:EFFORT: 00:15
:BENEFIT: 10
:RATIO: 0.40
:PRIORITY_NUM: 1
:VALUE:    -15.00
:END:

** TODO Read PagedAttention and DistServe papers from ArXiv
:LOGBOOK:
CLOCK: [2026-03-30 Mon 07:00]--[2026-03-30 Mon 08:00] =>  1:00
:END:


** TODO Read [[https://getdx.com/research/measuring-developer-productivity-with-the-dx-core-4/][Measuring developer productivity with DX Core 4]]
:PROPERTIES:
:EFFORT:  00:15
:BENEFIT: 10
:RATIO: 0.40
:VALUE:    -15.00
:PRIORITY_NUM: 1
:END:

** TODO Reformat all learning quotes to be sections
   :PROPERTIES:
   :EFFORT: 00:15
   :BENEFIT: 25
   :RATIO: 1.00
   :PRIORITY_NUM: 1
   :VALUE:    0.00
   :END:

** TODO Check OpenAI Dev Day summary
   SCHEDULED: <2026-10-10 Sat>
   :PROPERTIES:
   :EFFORT: 00:15
   :BENEFIT: 25
   :RATIO: 1.00
   :PRIORITY_NUM: 2
   :VALUE:    0.00
   :END:

** TODO [#A] Copy over notes from [[https://www.evernote.com/client/web#/notebooks][Evernote notebooks]] to Org
   :PROPERTIES:
   :LAST_REPEAT: [2025-10-06 Mon 08:14]
   :Effort:   20:00
   :BENEFIT: 10
   :RATIO: 0.40
   :PRIORITY_NUM: 1
   :VALUE:    -1990.00
   :END:
   - State "DONE"       from "TODO"       [2025-10-06 Mon 08:14]
   :LOGBOOK:
   CLOCK: [2025-10-13 Mon 06:58]--[2025-10-13 Mon 08:10] =>  1:12
   CLOCK: [2025-10-07 Tue 06:21]--[2025-10-07 Tue 07:38] =>  1:17
   CLOCK: [2025-10-06 Mon 06:08]--[2025-10-06 Mon 08:14] =>  2:06
   :END:


   - State "DONE"       from "TODO"       [2025-08-10 Sun 15:19]
   - State "DONE"       from "TODO"       [2025-07-29 Tue 11:25]
   - State "DONE"       from "TODO"       [2025-07-19 Sat 11:15]

** TODO Review Amazon annual shareholder letter
   SCHEDULED: <2027-04-11 Sun +52w>
   :PROPERTIES:
   :EFFORT: 00:15
   :BENEFIT: 10
   :RATIO: 0.40
   :LAST_REPEAT: [2026-04-13 Mon 20:22]
   :PRIORITY_NUM: 2
   :VALUE:    -15.00
   :END:


   - State "DONE"       from "TODO"       [2026-04-13 Mon 20:22]
   - State "DONE"       from "TODO"       [2025-04-12 Sat 18:16]
   - State "DONE"       from "TODO"       [2024-04-20 Sat 13:38]

** TODO Read [[https://www.ciwf.org.uk/media/5235024/The-life-of-laying-hens.pdf][The life of laying hens]]
   :PROPERTIES:
   :EFFORT: 00:15
   :BENEFIT: 10
   :RATIO: 0.40
   :PRIORITY_NUM: 1
   :VALUE:    -15.00
   :END:

** TODO Find a book on cleaning the house 5S, Marie Kondo, etc
   :PROPERTIES:
   :EFFORT: 00:15
   :BENEFIT: 25
   :RATIO: 1.00
   :PRIORITY_NUM: 1
   :VALUE:    0.00
   :END:

** TODO Read about process flow and flow chart drawing conventions
   :PROPERTIES:
   :EFFORT: 00:15
   :BENEFIT: 25
   :RATIO: 1.00
   :PRIORITY_NUM: 1
   :VALUE:    0.00
   :END:

** TODO Read [[https://drive.google.com/file/d/1ojOT-hP7nFUTNCUCGk_AKMN45E547Tvd/view?usp=drive_link][capitalism is better than donation for global poverty]]
   :PROPERTIES:
   :EFFORT: 00:15
   :BENEFIT: 25
   :RATIO: 1.00
   :PRIORITY_NUM: 1
   :VALUE:    0.00
   :END:

** TODO Read CMMI book
  :PROPERTIES:
  :EFFORT: 06:00
  :BENEFIT: 600
  :RATIO: 1.00
  :PRIORITY_NUM: 1
  :VALUE:    0.00
  :END:
  :LOGBOOK:
  CLOCK: [2025-01-12 Sun 10:40]--[2025-01-12 Sun 11:40] =>  1:00
  :END:

** TODO Review [[https://aiimpacts.org/evidence-on-good-forecasting-practices-from-the-good-judgment-project-an-accompanying-blog-post/][good forecasting practices]]                     :Learning:
   :PROPERTIES:
   :EFFORT: 00:15
   :BENEFIT: 10
   :RATIO: 0.40
   :PRIORITY_NUM: 1
   :VALUE:    -15.00
   :END:

** TODO Take the Superforecasting [[https://good-judgment.thinkific.com/courses/Superforecasting-Fundamentals][Good Judgement training]]
   :PROPERTIES:
   :EFFORT: 00:15
   :BENEFIT: 25
   :RATIO: 1.00
   :PRIORITY_NUM: 1
   :VALUE:    0.00
   :END:

** TODO Read about the [[https://c4model.com/][C4 architecture method]]
   :PROPERTIES:
   :EFFORT: 00:15
   :BENEFIT: 25
   :RATIO: 1.00
   :PRIORITY_NUM: 1
   :VALUE:    0.00
   :END:

** TODO Read [[https://joincolossus.com/article/ai-will-not-make-you-rich/][who will benefit from AI]]
   :PROPERTIES:
   :EFFORT: 00:15
   :BENEFIT: 25
   :RATIO: 1.00
   :PRIORITY_NUM: 1
   :VALUE:    0.00
   :END:


** TODO Read [[https://www.wsj.com/economy/a-guaranteed-income-wont-stop-people-from-wanting-to-work-03c4ab31?st=yeDmB6][A guaranteed income won't stop people from wanting to work]] :Learning:
   :PROPERTIES:
   :EFFORT: 00:15
   :BENEFIT: 10
   :RATIO: 0.40
   :PRIORITY_NUM: 1
   :VALUE:    -15.00
   :END:

** TODO Review [[https://rodneybrooks.com/blog/][Rodney Brooks blog]]
   :PROPERTIES:
   :EFFORT: 00:15
   :BENEFIT: 25
   :RATIO: 1.00
   :PRIORITY_NUM: 1
   :VALUE:    0.00
   :END:


** TODO Subscribe to eclipse threadx and freertos newsletters :Learning:
:PROPERTIES:
:EFFORT: 00:15
:BENEFIT: 10
:RATIO: 0.40
:VALUE:    -15.00
:PRIORITY_NUM: 1
:END:

** TODO Read [[https://www.wsj.com/business/energy-oil/europes-green-energy-rush-slashed-emissionsand-crippled-the-economy-e65a1a07?st=3Sx9NK][Europe green energy issues]]
   :PROPERTIES:
   :EFFORT: 00:15
   :BENEFIT: 25
   :VALUE:    0.00
   :PRIORITY_NUM: 1
   :END:

** TODO Look up MIT document on the semester you missed in CS - teaches version control, networking, security etc :Learning:
:PROPERTIES:
:EFFORT: 00:15
:BENEFIT: 10
:RATIO: 0.40
:END:

** TODO Save react Ai paper
:PROPERTIES:
:EFFORT: 00:15
:BENEFIT: 10
:RATIO: 0.40
:END:
